back_end/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "jop"], ["description", "oi"], ["created_at", "2023-06-21 20:58:09.177942"], ["updated_at", "2023-06-21 20:58:09.177942"]]
---
    def create
      @task = Task.new(task_params)

      if @task.save

UPDATE "tasks" SET "updated_at" = $1, "completed" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2023-06-21 21:26:23.908020"], ["completed", true], ["id", 7]]
---
    def update
      if @task.update(task_params)